{
  "articles": [
    {
      "id": "car-that-built-my-career",
      "title": "The Car That Built My Career - S1E1: Love and Trauma",
      "category": "Automotive",
      "date": "2025-11-04",
      "image": "landrover-series3.jpg",
      "content": [
        "For me, the career that would define my life began not with ambition, but with a four-year-old boy pinned by pure, brutal fear. It was 1981 in Uganda. We were travelling in a Land Rover Station Wagon, a vehicle built to conquer the planet, but in that moment, it lost its battle with gravity, rolling a catastrophic four times. The experience was immediate, kinetic chaos.",
        "The crash itself remains a scattered memory: confusion, the horrifying squeal of metal grinding against earth, and the dizzying cycle of blue sky to brown dust as the cabin tumbled. The Land Rover, a machine that symbolized freedom to others, became my first experience of total, mechanical betrayal. When the violence stopped, the sudden silence was louder than the impact. Everyone else walked away without injury. I was lucky, too, suffering only a sprained right arm, cuts, and bruises—physical marks that healed quickly. The real damage was internal. That day planted a deep, crippling fear that would govern the next six years of my movement.",
        "The Land Rover trauma became the specter haunting every vehicle I entered. The fear was rarely triggered by speed or engine noise; it was the subtle, spatial cues suggesting the world was about to invert again. Any slight banking on a curved road, any uneven ground that made the car feel marginally off-kilter, would send a lightning bolt of sheer dread through my core. I quickly named it the \"phantom tilt\"—a fractional lean that existed only in my mind, instantly summoning the memory of being tossed inside that wagon.",
        "This phobia broadened to include any situation where a vehicle's stability seemed compromised. Driving too close to a high kerb, an aggressive approach by another car, or especially creeping up near a wall—in those moments, I would mentally freeze. I saw the collision and the rollover before they happened. This made family trips difficult. I remember one relative, proud owner of a rugged Bedford TJ106 truck, keen to take me on adventures. While he felt excited, I felt trapped, and my fear consistently ruined the excitement of the journey.",
        "The situation was defined by an acute paradox: I loved cars. I loved the smell of hot oil, the deep thrum of an idling engine, and the complex, synchronized movement of parts. My fascination with the machinery was boundless, yet it was completely undermined by the Land Rover's singular act of violence. How could I crave to be near the very thing that had terrified me so profoundly? This contradiction—the deep pull of the machinery fighting the crushing weight of the memory—was agonizing. But it was also the engine of my future. For six long years, the Land Rover was not a vehicle; it was a permanent, terrifying monument. Every time I saw one, it reminded me of the fragile line between control and catastrophe.",
        "I spent those years in a constant state of internal tension, watching with envy as others simply enjoyed being passengers. This internal wrestling match slowly began to evolve. The simple, raw fear of rolling started to morph into an urgent, mechanical curiosity. I began to sense, perhaps subconsciously, that the only real way to disarm the fear was to master its origin. I needed to understand why it rolled, how it was constructed, and how it could be permanently fixed. By 1987, I was a boy burdened by lingering terror but suddenly full of repressed curiosity. That was the year my father, unaware of the psychological battle raging inside me, purchased the very tool I needed to begin my journey from victim to technician.",
        "The Land Rover troop carrier didn't just carry me from place to place; it carried me out of my trauma.",
        "That vehicle became my teacher. I started paying attention to how it worked, how the suspension absorbed shocks, how the steering responded, how the engine's power was delivered steadily and predictably. I began to understand that a vehicle wasn't just a box on wheels; it was a system, a carefully engineered balance of forces. The troop carrier was my first lesson in automotive engineering, and it sparked a fascination that would define my career.",
        "Years later, when I chose to study engineering, I knew exactly why. I wanted to understand machines, to master them, to ensure they would never betray anyone the way that Station Wagon had betrayed me. I wanted to build systems that were reliable, predictable, and safe. The Land Rover troop carrier showed me that was possible.",
        "Today, when I work on a car, when I diagnose a problem or explain a system to a student, I think about that troop carrier. It wasn't the fastest vehicle, or the most advanced, or the most luxurious. But it was the vehicle that gave me back my confidence. It was the vehicle that turned fear into curiosity, and curiosity into a career. It was, quite literally, the car that built my career."
      ]
    },
    {
      "id": "art-of-maintenance",
      "title": "The Most Important Tool is Patience",
      "category": "Automotive",
      "date": "2025-08-04",
      "image": "art-of-maintenance.jpg",
      "content": [
        "There's a conversation that happens between you and a machine when you're the one who keeps it alive. It's a language of sounds, feelings, and vibrations that speaks of tolerance, stress, and wear. It's a language I've spent years learning, and I rarely let a mechanic interrupt it. But recently, it was my wife's car that started talking, and it began with a flat tyre. \"Not a problem,\" I thought, and called the tyre repair man from the local fuel station with the exact size.",
        "He showed up with a tyre 1.5 inches taller than the other three. I looked at the tyre, then at him, and realised the conversation had to change. I had to explain that this car has an ABS system that constantly measures the speed of each wheel; a bigger wheel would spin slower and throw the entire system into a state of digital confusion. It has electric power steering that relies on perfect balance. A single, oversized tyre would make the car unstable, fighting itself with every rotation. He looked at me, then at the tyre, and I could see the disconnect. In that moment, I wasn't just fixing a flat; I was confronting a bigger question: we love getting new technology, but have we set up the structures to properly maintain it?",
        "Understanding that technology is the first step, and for me, it always starts with listening. A healthy engine starting is a predictable orchestra. You have the sharp whine of the starter motor, the first loud, confident explosions of combustion, and then the deep, rhythmic \"thurddy grrr\" of the camshaft pushing the valves open and closed. You can hear the soft \"pop\" of the intake manifold and the lulling hush of the silencer telling the engine, \"Not so loud.\" It's a symphony of controlled power. A sick engine sings a different tune—a hesitant cough, a metallic click, a whining belt. I've taught a class where we've silenced each of those sounds, one by one, and the students have had to diagnose the problem just by listening to what was missing. It's a skill that requires you to tune out the noise and focus on the machine's true voice.",
        "Of course, the most important tool in diagnostics isn't a stethoscope; it's patience. I remember rushing through a simple brake job once, a task I'd done a dozen times. I was tired, frustrated, and wanted it done. In my haste, I cross-threaded a bolt on the caliper. A simple mistake, born from impatience, turned a one-hour job into a four-hour ordeal of drilling, re-tapping, and a desperate search for a replacement part. The machine didn't care about my schedule. It only responded to the correct process, done with care. That bolt taught me a lesson that no manual ever could: fighting with a machine is a battle you will always lose. You have to work with it.",
        "And that's the marvel of it. When you buy a machine, you are buying the final product of its creator's imagination. From that point on, it's up to you to continue the conversation. I believe not all machines are for everyone, and that's the beauty of choice. I look at modern Volvo drivers, and I don't see them changing a tyre themselves. That's okay. The car is designed to be a sealed system, a comfortable appliance that insulates you from the mechanical world. It's designed to be taken to a garage every time something goes wrong. For some, that's a feature. For me, it's a conversation I'm not willing to miss."
      ]
    },
    {
      "id": "networks",
      "title": "The Internet in Africa is Just a Connection to Europe",
      "category": "Networks",
      "date": "2025-07-21",
      "image": "network-africa.jpg",
      "content": [
        "Every time I start a new computer networks class, I tell my students the same thing: \"The Internet in Africa is just a connection to Europe.\" I tell them if you could dig a hole from here in Uganda, lay a cable, and connect it to a computer or a phone in London, you would never have to pay for the internet again.",
        "Of course, it's a simplification. But it's a useful one. It cuts through the jargon and reveals a fundamental truth about our digital infrastructure. Right now, for an email to go from Kampala to Nairobi, it often has to travel thousands of kilometers to Europe and back again. This isn't just inefficient; it's a form of digital bloat that holds us back. It's like having to drive across the continent just to visit your neighbor. It works, but it's slow, expensive, and completely unnecessary.",
        "This is the legacy of how our internet was built—as spokes on a wheel, with the hub always somewhere else. But the future doesn't have to look like the past.",
        "What if we changed the narrative? What if, when I teach my students, I could say, \"The internet is a connection to Kenya, to Tanzania, to the DRC, to South Sudan\"? What if our primary links were with each other?",
        "This isn't a dream. It's a practical engineering challenge, and it's one we can solve. It means building more Internet Exchange Points (IXPs) right here. It means laying more terrestrial fiber across our borders. It means convincing our local providers that peering with a network in Kinshasa is just as valuable—if not more so—than peering with one in Paris. It means creating a robust, resilient, and truly <em>African</em> network.",
        "A network where data created in Africa, for Africans, stays in Africa. A network that is simple, efficient, and reliable."
      ]
    },
    {
      "id": "automotive",
      "title": "The Soul of the Machine",
      "category": "Automotive",
      "date": "2025-07-14",
      "image": "land-cruiser.jpg",
      "content": [
        "I'm sad that cars have become disposable. It seems no one buys a vehicle they intend to keep for ten years, and manufacturers have followed suit. We're surrounded by machines packed with electronics designed for a limited lifespan, where a single failed, non-repairable module can render the entire vehicle useless. We've accepted that a car's value is measured by the size of its infotainment screen rather than the integrity of its engineering. But I believe in a different philosophy—one where a machine is valued for its durability, its simplicity, and its ability to be maintained.",
        "This isn't just a preference; it's a pragmatic worldview rooted in my experience as an engineer. My core belief, whether I'm looking at software or a transmission, is in an \"anti-bloat\" design. A system should do its job perfectly without unnecessary complexity.",
        "Here in Africa, that theory is tested daily. Every quarter, I find myself needing 4L or 4H, and there is one vehicle that stands as a masterpiece of engineering for this environment: the Land Cruiser 80 Series. It's not about nostalgia; it's about purpose. It's a vehicle built with the understanding that it will face harsh conditions and will need to be repaired far from a dealership, often with basic tools. It has what it needs to do its job, and nothing more. That, to me, is the definition of good design.",
        "This isn't about being stuck in the past. It's about recognizing that we're losing something important. We're trading the soul of the machine for a list of features. We're giving up the satisfaction of understanding and maintaining our own vehicles for the convenience of a disposable appliance. We should demand more from our technology, whether it has four wheels or a circuit board. We should demand things that are built to last."
      ]
    },
    {
      "id": "aviation",
      "title": "The Simple Genius of the Turbofan",
      "category": "Aviation",
      "date": "2025-07-07",
      "image": "turbofan-engine.jpg",
      "content": [
        "I'm a pilot, and while I love the reciprocating engines I fly, the engineer in me is always slightly uneasy. There is just so much going on inside them—so many moving parts, so many potential points of failure, and so many different materials with different heat coefficients, all expanding at different rates. And someone thought to put that on an airplane. It's a marvel that it works so well, but it's a complex one.",
        "That's why I truly love the turbofan engine. It's a marvel of simplicity and efficiency. While a turboprop is impressive, the turbofan's core principle—a giant fan at the front pushing a huge volume of air <em>around</em> the core engine—is a masterclass in \"anti-bloat\" design. The engine's primary job is to spin that fan. It's a beautifully focused and powerful solution that solves the problem of thrust with incredible elegance.",
        "This is what I love about great engineering: it solves a complex problem with a simple, robust answer. My dream job isn't just flying jets one day; it's working on the software for the control systems that manage these incredible machines. I want to be one of the people who understands and refines that bridge between the pilot's intent and the engine's raw power.",
        "For me, the perfect aircraft is the Cessna 208 Caravan. It's the aviation equivalent of a Land Cruiser—a rugged, reliable workhorse that can handle challenging environments without unnecessary complexity. It embodies the same philosophy as the turbofan: it does its job perfectly. My ideal life would be to combine both my worlds: continuing my work as a systems engineer while also serving as a part-time instructor on the C208. It's all about mastering and teaching the systems that work."
      ]
    },
    {
      "id": "linux",
      "title": "My Operating System is a Land Cruiser",
      "category": "Linux",
      "date": "2025-06-30",
      "image": "ubuntu-terminal.jpg",
      "content": [
        "Software today is bloated. Operating systems, applications—they all seem to suffer from a desire to be everything to everyone, packed with features I'll never use and visual \"bling\" that just gets in the way. That's why I use Ubuntu.",
        "To me, Ubuntu is the Land Cruiser 79 Series of operating systems. It's simple, powerful, and utterly reliable. The package manager is straightforward, and the entire system is easy to understand and maintain. It doesn't distract me with unnecessary lights and fluff; it just provides a rock-solid foundation for me to do my work.",
        "I loved Linux so much that I once packed an old machine with as many network PCI cards as it could hold, determined to build my own BGP router from scratch. I wanted to enjoy both worlds: the simplicity of the Linux command line and the marvel of what I could achieve with it. It was only later, when I started working for an ISP, that I had a realization: what I had built was, in principle, what a carrier-grade Juniper router is all about.",
        "My fight against bloat has led me to a new project: building my own minimal desktop environment on top of the Ubuntu kernel. The idea is to have a simple Django application that serves everything I need: my VS Code editor, an email client, a web browser, and a custom terminal for my network engineering tasks. Nothing more. It's about creating the perfect tool for the job, stripped of everything that doesn't serve a direct purpose."
      ]
    },
    {
      "id": "python",
      "title": "The Language That Speaks to Machines",
      "category": "Python",
      "date": "2025-06-23",
      "image": "python-microcontroller.jpg",
      "content": [
        "I work with embedded systems every day, and the biggest challenge is often the gap between the hardware and the software. You can have a brilliant microcontroller, but if it's difficult to program, its potential is locked away. This is where Python has been a game-changer for me.",
        "Python, and specifically MicroPython, is the language that lets me \"speak\" to machines. It has all the libraries and utilities I need to make microcontrollers interactive and intelligent. The fact that I can now use the same high-level language to write a web application and to control a tiny ESP32 board is incredibly powerful. It simplifies the entire development process.",
        "I also believe some of Python's greatest strengths are underrated. People often jump to big frameworks, but I think <strong>Flask</strong> is one of the most valuable tools for learning. It was only after I truly understood Flask that the architecture of a complex framework like Django made sense. It teaches you the fundamentals of web development from the ground up.",
        "Similarly, <strong>Object-Oriented Programming (OOP)</strong> is a concept that is often taken for granted. It was only after I began learning OOP—and I cannot say I have fully learned it—that I started thinking about how the human lungs do what they do. I tried to break down the respiratory system into code, including the complex makeup of the air we breathe and a function or method to extract energy from that air. It got incredibly complex, but the exercise was profound. The fundamental understanding of breaking a system down into its core objects and functions is what makes OOP a true marvel."
      ]
    },
    {
      "id": "embedded",
      "title": "The Hidden Genius All Around Us",
      "category": "Embedded",
      "date": "2025-06-16",
      "image": "embedded-systems.jpg",
      "content": [
        "We're surrounded by clever embedded systems, but most of them are hidden in plain sight. Take your smart TV. We see it as a screen, but as an engineer, I see a masterpiece of embedded systems design.",
        "Think about it: it's a single device that has to manage HDMI and USB interfaces, decode dozens of video and audio formats, run a full operating system with an app store, and maintain a constant network connection. All of this has to work seamlessly, reliably, and without the user ever thinking about the complexity under the hood.",
        "The same is true for an Airbus A350, which people think is highly automated but is actually a complex collaboration between the pilot and countless embedded control systems. That's why my preferred seat on a commercial aircraft is around the wings. Before the flight, the pilot will set the flaps and you will hear the motors spin up as they take their set positions. I don't know if anyone thinks of how far away the pilot is seated from the control surfaces they are sending commands to. These motors have to send feedback to the pilot to say they are actually in the correct position. For me, that is all the entertainment I need. The icing on the cake is how the autopilot works with all the control surfaces to keep the machine where the pilot has set it, guided by what the Flight Management System (FMS) is telling it to do. The screens are just the 'mouth pieces' of the machine telling the pilots 'you told me to do this, I am doing it.'",
        "When it comes to my own quick projects, my go-to is an <strong>ESP32</strong>. It's about choosing the right tool for the job—a tool that is powerful, efficient, and doesn't come with unnecessary baggage. It's the same philosophy, whether it's in a smart TV or on my workbench."
      ]
    },
    {
      "id": "two-flights-two-philosophies",
      "title": "Two Flights, Two Philosophies: From the A350 to the 737 MAX",
      "category": "Aviation",
      "date": "August 23, 2025",
      "image": "A350Nigeria.jpg",
      "content": [
        "There are moments when your life's passions—engineering, aviation, technology—don't just converge, they collide. My journey today from Lagos was one of those collisions. I was about to fly on two of the most talked-about aircraft in the world, machines that tell two profoundly different stories about humanity's relationship with the sky.",
        "First, the Airbus A350-1000, a vision of the future. Then, the Boeing 737 MAX, a legend grappling with its own legacy. This isn't just a trip report; it's a tale of two philosophies, and I had a front-row seat.",
        "The Soul of a New Machine: The A350 from Seat 36L",
        "The experience began before I even stepped on board. Standing at the pre-boarding area for Gate E55 at Murtala Muhammed International, I knew this would be interesting. E55 is tucked away in a tight corner of the terminal, a gate that requires a sharp, almost delicate turn for any aircraft, let alone one of the largest passenger jets in the sky. I watched her approach, ET-BAX, an A350-1000. She was immense, yet moved with an impossible grace. The nose wheel swiveled at an angle so sharp it defied belief, a beautiful, exaggerated display of agility as she navigated the confined space before a tow tractor gently nudged her into place. This was no mere airplane; this was a statement.",
        "Boarding in Zone 3, I made my way to 36L and braced for the usual compromise of a 6'2\" frame in an economy seat. I sat down and my brain stopped. My knees had space. A lot of space. Nearly half a foot of it. I looked out the window and realized my seat was perfectly aligned with the wing's centerline, and a quick glance down confirmed the impossible: I was sitting directly on top of the right main landing gear. The cabin itself felt vast, the overhead bins disappearing into the ceiling without intrusion. This machine wasn't just engineered; it was designed, with a palpable sense of the human who would inhabit it.",
        "Then came the pushback, and the world outside went quiet. As the pilots ran their checklist, the wing came alive. Slats and flaps extended to the `1+F` takeoff configuration, a complex choreography of surfaces creating the perfect shape for lift. The two massive Rolls-Royce Trent XWB engines began to breathe, and my mind went away. I wasn't a passenger anymore. I was inside the machine's mind, imagining myself writing the code for the start sequence.",
        "*Initial state: APU bleed air ON. Command: Open starter valve.* I felt the faint vibration as the N2 spool began to turn, its sound a deep, almost silent hum, nothing like the metallic scream of older jets. *Condition: N2 rotation > 25%. Command: Introduce fuel, fire igniters.* There was no sudden kick, no audible pop as the fuel ignited—just a seamless, swelling surge of power as the engine spun up and sustained itself. It was the perfect execution of a software sequence, the pilot's intent translated into reality by a network of microcontrollers hidden beneath the floor.",
        "The pushback master gave his signature wave, and we taxied. From my perch atop the landing gear, I could feel everything. Every touch of the brakes by the pilot resonated through the floor, the complex six-wheel bogie articulating through the turns, managed by a brake-by-wire system that felt both precise and alive.",
        "Lined up on Runway 18, cleared for an immediate takeoff. The captain unleashed the engines. The windsock was ramrod straight, a gift of a headwind. As we surged forward, I saw it. The wing *flexed*. Not a shudder, but a deep, dramatic, beautiful arc. The engine nacelle on its pylon trembled, absorbing the immense forces—a sight I've never witnessed on another aircraft. Before my pilot's brain could even whisper \"V1,\" we were rotating, hurled into the sky by the wind.",
        "And then the feeling hit me, a profound, almost shocking realization. For the first time in my life, I was being carried aloft not by metal, but by wings of woven carbon fiber. It was a new kind of strength, a new sensation of flight. Eight minutes later, the wing was clean, the climb was effortless, and we banked right, setting course for Addis.",
        "Even in turbulence, the A350 was a revelation. The pilot made a few sharp turns to avoid the worst of the dirty air, but when we hit the bumps, it wasn't a jarring ordeal. It was a beautiful dance. From my seat, I watched the wingtips flex gracefully, absorbing the energy, while the fuselage swayed in a gentle, coordinated rhythm. I was a partner in this dance, feeling the machine respond to the sky not with brute force, but with an intelligent, responsive grace.",
        "The descent into Addis Ababa for runway 25L was the final act. From my position, I could hear the lifeblood of the aircraft at work. A series of deep, hydraulic thumps and whirs resonated from below as the landing gear pressurized and locked into place. On touchdown, the captain was keen not to brake harshly. There was no sudden, aggressive deceleration, just a long, smooth rollout, the auto-brakes and reverse thrust working in perfect harmony. It was the final, quiet testament to the machine's sophistication.",
        "A Brief Layover, A Shift in Perspective",
        "The layover in Addis Ababa was a frantic 30 minutes—just enough time to deplane and race to the next gate. In that short walk, I was transitioning between more than just two airplanes; I was transitioning between two eras of aviation design. The air still hummed with the quiet power of the A350, but my destination was a different machine entirely.",
        "The Legend and the Legacy: Boarding the 737 MAX",
        "Stepping onto the 737 MAX, aircraft ET-AVX, was an immediate, visceral shift. My seat was 27L, but someone was already in it. After a brief shuffle, I settled in, my frame struggling to fit in a way it never had on the A350. The narrow-body cabin is familiar, a classic design honed over decades, but it's impossible to board this particular aircraft without a profound sense of gravity.",
        "We taxied back out to the same runway, 25L. As we held short, a Boeing 777-ER, the MAX's bigger, older brother, thundered past us and climbed into the sky to do what she was meant to do: dance. Then, it was our turn.",
        "The flight to Kigali was completely full. As we lined up, all I could think about was that from this exact spot, on a Sunday morning in March 2019, some people did not make it. The MAX failed them. The world was quick to judge the Ethiopian pilots, to whisper about inexperience, only for the truth to emerge later—a story of software, sensors, and a system that betrayed its crew. And here I was, on the same runway, on the same type of aircraft, now recertified and redeemed.",
        "The captain pushed the throttles forward. The takeoff roll felt long, powerful, eating up 75% of the runway with our heavy load. With every passing meter of concrete, my mind was on that other flight. It was a heavy feeling, a mix of an engineer's confidence in the fixes and a pilot's empathy for the crew who faced an impossible situation. This takeoff wasn't just a departure; it was an act of faith, a testament to the entire aviation industry's painful, public, and necessary process of correction. We climbed out into the sky, and the machine flew flawlessly. It was a somber, silent tribute.",
        "The rest of the flight on the MAX was uneventful, but the landing in Kigali was a masterclass. I have been on most of Ethiopian's 737 flights, and their pilots have truly mastered this machine. It is not a landing; it is a *transition*. They seamlessly and effortlessly transition the aircraft from air to ground. A crosswind gave us a slight jarr to the right, which the pilot overcorrected with left rudder—a masterful display of skill.",
        "As I deplaned, the familiar question hit me, but this time it felt different, heavier. Should I transition from my Cessna 172s to these big jets? The struggle isn't just about choosing a career; it's about choosing an identity. From the 172, the obvious transition would be to the Cessna 208 Caravan, a masterpiece built for Africa with a soft spot in my heart. That is the more achievable goal. But if I push myself hard enough, the path leads to a much larger, more daunting question: would I leave my current career? Would I walk away from the joy of building things from the ground up—from packing a Linux box with network cards to make a BGP router, to designing the logic for an embedded system? I need to understand the fundamentals, the very soul of the machine.",
        "This journey gave me the answer. The A350 was a symphony of systems I longed to orchestrate. The 737 MAX was a stark reminder of the human who must ultimately be the master of the machine, no matter how complex the code. The two philosophies that flew me across Africa were the two philosophies battling inside my own head.",
        "And as my mind wanders, it always comes to the same conclusion. The goal isn't just to be in the left seat. It's to be the one who can explain the soul of the machine to the person who sits there. To truly satisfy all these passions—to understand the machine, to fly it, and to teach others—the path becomes clear. To become an instructor for an airline or a manufacturer is to become the bridge between the silicon and the sky. It's the ultimate form of systems engineering. Perhaps that is the transition that truly matters."
      ]
    },
    {
      "id": "building-africas-nervous-system",
      "title": "Building Africa's Nervous System: Reflections from AfPIF 2025",
      "category": "Networks",
      "content": [
        "Standing in Nigeria, I felt the echo of history beneath my feet. This land was not just a modern nation; it was a nexus in the vast West African trade network, an empire of commerce that predated modern history. Centuries ago, caravans—the terrestrial fiber of their day—crisscrossed this region, carrying not just gold and salt, but culture, knowledge, and influence. Cities like Timbuktu and Gao were the great data centers, the IXPs where value was exchanged and amplified. When Mansa Musa made his pilgrimage, the world wasn't just stunned by his wealth; they were awakened to the existence of a sophisticated, self-sufficient economic system. He put his network on the global map.",
        "For me, hosting the African Peering and Interconnection Forum (AfPIF) 2025 here felt like a deliberate act of historical reconnection. The new gold and salt are data and connectivity. The new caravans are fiber optic cables. And the discussions in the room, whether the participants articulated it this way or not, were about a single, profound goal: to rebuild those ancient, powerful trade routes for the digital age and put Africa back on the map, not as a consumer of external networks, but as the master of its own. My last article, \"The Internet in Africa is Just a Connection to Europe,\" was a thesis from 30,000 feet. This week, on the ground, I saw the collision of that theory with our historical reality.",
        "The Vibe in the Room",
        "I listened as the hyperscalers—AWS, Meta, Google—delivered a consistent and clear message: \"We are interested in Africa, but there is work you need to do. Organize your networks. Grow the local fabric, the inland terrestrial fiber, and we will come.\" It was a conversation heavy with opportunity, but also with a familiar sense of frustration.",
        "Being physically in the room was validating. A presentation from Telegeography put a hard number on the feeling we all have: for the last five years, around 80% of Africa's total international connectivity has been with Europe. The philosophy I continue to talk about isn't just a philosophy; it's a statistical reality. For all the progress we've made, cloud access continues to be the primary driver for that external traffic. We are not building networks for ourselves; we are building them to attract the hyperscalers.",
        "Ethiopia, with its rapidly growing population approaching 130 million people, according to the United Nations Population Fund, was a topic of great interest—a massive, newly opened digital marketplace. Yet, who is laying the groundwork to actually reach those people? The conversation then hit closer to home. I am from Uganda, a landlocked nation. My country, along with our neighbors in Western DRC, Southern Sudan, Burundi, and Rwanda, connects to the world primarily through terrestrial fiber routes to Nairobi and, subsequently, the submarine cable landing stations in Mombasa—a dependency confirmed by network operators like Liquid Intelligent Technologies in their own infrastructure announcements. I am being told my local IXP and all our aggregated traffic is insignificant to attract the CDNs we so desperately need. Yet, Kenya's digital economy continues to grow because our collective demand is what drives their numbers up. How do we shout this from the mountains? How do we get the large CDNs to take a risk on Uganda?",
        "Over coffee, I sat with representatives from MTN, RENU, and the UIXP. The ideas were flowing. \"We need another IX in Uganda,\" one said, \"but it must not be in a telco's building. It must be carrier-neutral.\" The insight was brilliant, the need was urgent. But I had to ask: \"Why did we travel 6,500 kilometers, leave our country, to have this conversation here? Shouldn't we be having it at home?\"",
        "A Digital Identity",
        "The big push at the forum was for more Autonomous System Numbers (ASNs) and personal IP space. AFRINIC's own statistics show that Africa has roughly 2,500 allocated ASNs, a tiny fraction of the 100,000+ that form the global internet. As a passionate knowledge-sharer and educator on this continent, I feel this number reflects my own failures. Have I done enough to grow more engineers? Have I done enough to evangelize how the internet works and how we can grow these numbers to a point where they serve us?",
        "Are the younger generations being taught how to build the African internet—how to build Africa's nervous system? Or am I being naive? Is there something deeper I am not seeing? The bigger picture is that when an individual or a small business gets their own ASN and IP space, they stop being a mere statistic behind a large ISP. They become a nerve ending. They become a tangible part of the nervous system we are trying to lay the foundation for.",
        "The Nervous System and the Lymph Nodes",
        "I believe the IXPs should be supported to do what they do best: exchange local traffic and be the driving force for all the local ASNs on the ground. It makes me ask, how many ASNs are in the capital of my home area, Soroti? How many local businesses are \"trading\" online using their own ASN and IP space?",
        "We each need to be deliberate about creating as many nerve endings as possible so that Africa can get back to feeling and learning about her own body, network by network, IXP by IXP. Africa has a soul. For us to awaken that soul, we must wake her up from the extremities. Rather than continue to allow the \"brain\" to exist in Europe, let's build the brain here. As an embedded engineer, I am frustrated at the slow growth of this organism. I may be naive, but in as much as these things take time, I believe history will judge us very harshly for what we saw and did not correct. This is analogous to the ship that headed to the iceberg despite numerous calls to change course. We may not have invented much as this generation and are merely consumers, but let's take that data we are consuming and do something with it. For me, I see us being able to build this organism, but I am frustrated by what we are doing with what we have.",
        "A Pause to Action",
        "AfPIF left me with a profound sense of duty, a pause not of inaction, but of deliberate preparation. It crystallized the challenge I have set for myself. The power to build this nervous system doesn't lie solely with the hyperscalers, who serve their own purpose. It lies with the open-source community, with the educators, with the engineers on the ground who believe in real change.",
        "This forum was my opening statement for what must be done. It was also a place for me to solicit help. My commitment is this: I will document my progress in this mission, starting with the simplest of acts—asking the network engineers around me, one by one, \"Do you know what an AS number is? Do you know how the internet truly works?\"",
        "My goal is to help grow Africa to a point where we trade not just with company names, but with AS numbers. An ASN is more than a number; it is a declaration of digital sovereignty. It is your identity, your plot of land in the digital world. By claiming this space, we ensure each part of our rich cultural tapestry and diversity is represented online. The work is immense, but the ancient caravans were not built in a day. They were built one step, one route, one connection at a time. It is time to begin our journey.",
        "Sources",
        "* Africa-Europe Traffic: TeleGeography, \"African Network Geography Update,\" AfPIF 2023 Presentation.",
        "* Ethiopia Population: United Nations Population Fund, \"World Population Dashboard - Ethiopia,\" 2025 Data.",
        "* East Africa Connectivity: Liquid Intelligent Technologies, \"Announces the upgrade of its 1,300km fibre route,\" September 11, 2024. Press release detailing the Mombasa-to-Uganda-border route as critical for regional connectivity.",
        "* ASN Data: AFRINIC Statistics Portal (for African numbers) and aggregated global data from sources including the CIDR Report (for the 100,000+ global figure)."
      ]
    },
    {
      "id": "two-flights-two-philosophies",
      "title": "Two Flights, Two Philosophies: From the A350 to the 737 MAX",
      "category": "Aviation",
      "date": "August 23, 2025",
      "image": "NigeriaAFPIF.jpg",
      "content": [
        "There are moments when your life's passions—engineering, aviation, technology—don't just converge, they collide. My journey today from Lagos was one of those collisions. I was about to fly on two of the most talked-about aircraft in the world, machines that tell two profoundly different stories about humanity's relationship with the sky.",
        "First, the Airbus A350-1000, a vision of the future. Then, the Boeing 737 MAX, a legend grappling with its own legacy. This isn't just a trip report; it's a tale of two philosophies, and I had a front-row seat.",
        "The Soul of a New Machine: The A350 from Seat 36L",
        "The experience began before I even stepped on board. Standing at the pre-boarding area for Gate E55 at Murtala Muhammed International, I knew this would be interesting. E55 is tucked away in a tight corner of the terminal, a gate that requires a sharp, almost delicate turn for any aircraft, let alone one of the largest passenger jets in the sky. I watched her approach, ET-BAX, an A350-1000. She was immense, yet moved with an impossible grace. The nose wheel swiveled at an angle so sharp it defied belief, a beautiful, exaggerated display of agility as she navigated the confined space before a tow tractor gently nudged her into place. This was no mere airplane; this was a statement.",
        "Boarding in Zone 3, I made my way to 36L and braced for the usual compromise of a 6'2\" frame in an economy seat. I sat down and my brain stopped. My knees had space. A lot of space. Nearly half a foot of it. I looked out the window and realized my seat was perfectly aligned with the wing's centerline, and a quick glance down confirmed the impossible: I was sitting directly on top of the right main landing gear. The cabin itself felt vast, the overhead bins disappearing into the ceiling without intrusion. This machine wasn't just engineered; it was designed, with a palpable sense of the human who would inhabit it.",
        "Then came the pushback, and the world outside went quiet. As the pilots ran their checklist, the wing came alive. Slats and flaps extended to the `1+F` takeoff configuration, a complex choreography of surfaces creating the perfect shape for lift. The two massive Rolls-Royce Trent XWB engines began to breathe, and my mind went away. I wasn't a passenger anymore. I was inside the machine's mind, imagining myself writing the code for the start sequence.",
        "*Initial state: APU bleed air ON. Command: Open starter valve.* I felt the faint vibration as the N2 spool began to turn, its sound a deep, almost silent hum, nothing like the metallic scream of older jets. *Condition: N2 rotation > 25%. Command: Introduce fuel, fire igniters.* There was no sudden kick, no audible pop as the fuel ignited—just a seamless, swelling surge of power as the engine spun up and sustained itself. It was the perfect execution of a software sequence, the pilot's intent translated into reality by a network of microcontrollers hidden beneath the floor.",
        "The pushback master gave his signature wave, and we taxied. From my perch atop the landing gear, I could feel everything. Every touch of the brakes by the pilot resonated through the floor, the complex six-wheel bogie articulating through the turns, managed by a brake-by-wire system that felt both precise and alive.",
        "Lined up on Runway 18, cleared for an immediate takeoff. The captain unleashed the engines. The windsock was ramrod straight, a gift of a headwind. As we surged forward, I saw it. The wing *flexed*. Not a shudder, but a deep, dramatic, beautiful arc. The engine nacelle on its pylon trembled, absorbing the immense forces—a sight I've never witnessed on another aircraft. Before my pilot's brain could even whisper \"V1,\" we were rotating, hurled into the sky by the wind.",
        "And then the feeling hit me, a profound, almost shocking realization. For the first time in my life, I was being carried aloft not by metal, but by wings of woven carbon fiber. It was a new kind of strength, a new sensation of flight. Eight minutes later, the wing was clean, the climb was effortless, and we banked right, setting course for Addis.",
        "Even in turbulence, the A350 was a revelation. The pilot made a few sharp turns to avoid the worst of the dirty air, but when we hit the bumps, it wasn't a jarring ordeal. It was a beautiful dance. From my seat, I watched the wingtips flex gracefully, absorbing the energy, while the fuselage swayed in a gentle, coordinated rhythm. I was a partner in this dance, feeling the machine respond to the sky not with brute force, but with an intelligent, responsive grace.",
        "The descent into Addis Ababa for runway 25L was the final act. From my position, I could hear the lifeblood of the aircraft at work. A series of deep, hydraulic thumps and whirs resonated from below as the landing gear pressurized and locked into place. On touchdown, the captain was keen not to brake harshly. There was no sudden, aggressive deceleration, just a long, smooth rollout, the auto-brakes and reverse thrust working in perfect harmony. It was the final, quiet testament to the machine's sophistication.",
        "A Brief Layover, A Shift in Perspective",
        "The layover in Addis Ababa was a frantic 30 minutes—just enough time to deplane and race to the next gate. In that short walk, I was transitioning between more than just two airplanes; I was transitioning between two eras of aviation design. The air still hummed with the quiet power of the A350, but my destination was a different machine entirely.",
        "The Legend and the Legacy: Boarding the 737 MAX",
        "Stepping onto the 737 MAX, aircraft ET-AVX, was an immediate, visceral shift. My seat was 27L, but someone was already in it. After a brief shuffle, I settled in, my frame struggling to fit in a way it never had on the A350. The narrow-body cabin is familiar, a classic design honed over decades, but it's impossible to board this particular aircraft without a profound sense of gravity.",
        "We taxied back out to the same runway, 25L. As we held short, a Boeing 777-ER, the MAX's bigger, older brother, thundered past us and climbed into the sky to do what she was meant to do: dance. Then, it was our turn.",
        "The flight to Kigali was completely full. As we lined up, all I could think about was that from this exact spot, on a Sunday morning in March 2019, some people did not make it. The MAX failed them. The world was quick to judge the Ethiopian pilots, to whisper about inexperience, only for the truth to emerge later—a story of software, sensors, and a system that betrayed its crew. And here I was, on the same runway, on the same type of aircraft, now recertified and redeemed.",
        "The captain pushed the throttles forward. The takeoff roll felt long, powerful, eating up 75% of the runway with our heavy load. With every passing meter of concrete, my mind was on that other flight. It was a heavy feeling, a mix of an engineer's confidence in the fixes and a pilot's empathy for the crew who faced an impossible situation. This takeoff wasn't just a departure; it was an act of faith, a testament to the entire aviation industry's painful, public, and necessary process of correction. We climbed out into the sky, and the machine flew flawlessly. It was a somber, silent tribute.",
        "The rest of the flight on the MAX was uneventful, but the landing in Kigali was a masterclass. I have been on most of Ethiopian's 737 flights, and their pilots have truly mastered this machine. It is not a landing; it is a *transition*. They seamlessly and effortlessly transition the aircraft from air to ground. A crosswind gave us a slight jarr to the right, which the pilot overcorrected with left rudder—a masterful display of skill.",
        "As I deplaned, the familiar question hit me, but this time it felt different, heavier. Should I transition from my Cessna 172s to these big jets? The struggle isn't just about choosing a career; it's about choosing an identity. From the 172, the obvious transition would be to the Cessna 208 Caravan, a masterpiece built for Africa with a soft spot in my heart. That is the more achievable goal. But if I push myself hard enough, the path leads to a much larger, more daunting question: would I leave my current career? Would I walk away from the joy of building things from the ground up—from packing a Linux box with network cards to make a BGP router, to designing the logic for an embedded system? I need to understand the fundamentals, the very soul of the machine.",
        "This journey gave me the answer. The A350 was a symphony of systems I longed to orchestrate. The 737 MAX was a stark reminder of the human who must ultimately be the master of the machine, no matter how complex the code. The two philosophies that flew me across Africa were the two philosophies battling inside my own head.",
        "And as my mind wanders, it always comes to the same conclusion. The goal isn't just to be in the left seat. It's to be the one who can explain the soul of the machine to the person who sits there. To truly satisfy all these passions—to understand the machine, to fly it, and to teach others—the path becomes clear. To become an instructor for an airline or a manufacturer is to become the bridge between the silicon and the sky. It's the ultimate form of systems engineering. Perhaps that is the transition that truly matters."
      ]
    }
  ]
}
